/*
 * 给定三个点一定可以找到三个四边形   分别以这三个点为原点   寻找的那个点为原点的对立点
#include<iostream>
using namespace std;

int main(){
    int a[5][2];
    for(int i = 0; i < 3; i++){
        cin >> a[i][0] >> a[i][1];
    }
    cout << 3 << endl;
    int x1, y1, x2, y2;
    x1 = a[1][0] - a[0][0];
    y1 = a[1][1] - a[0][1];
    x2 = a[2][0] - a[0][0];
    y2 = a[2][1] - a[0][1];
    cout << a[0][0] + x1 + x2 << " " << a[0][1] + y1 + y2 << endl;

    x1 = a[0][0] - a[1][0];
    y1 = a[0][1] - a[1][1];
    x2 = a[2][0] - a[1][0];
    y2 = a[2][1] - a[1][1];
    cout << a[1][0] + x1 + x2 << " " << a[1][1] + y1 + y2 << endl;

    x1 = a[1][0] - a[2][0];
    y1 = a[1][1] - a[2][1];
    x2 = a[0][0] - a[2][0];
    y2 = a[0][1] - a[2][1];
    cout << a[2][0] + x1 + x2 << " " << a[2][1] + y1 + y2 << endl;
    return 0;
}*/